# ServerGUID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..ServerGUID Property
PipeFittingAndAccessoryData Class See Also
---
The GUID of the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Guid ServerGUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServerGUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid ServerGUID {
	Guid get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace